@eeaton @apeabody 

Foundation code originally had two entries in the runtime env variables, `ROLES` and `SOURCE_ID`

```
  service_config = {
    service_account_email = google_service_account.cloudfunction.email
    runtime_env_variables = {
      ROLES     = join(",", var.roles_to_monitor)
      SOURCE_ID = google_scc_source.cai_monitoring.id
    }
  }
```

Using the code from the latest version of the provider with the permadiff fix we have

```
func environmentVariablesDiffSuppress(k, old, new string, d *schema.ResourceData) bool {
	if k == "service_config.0.environment_variables.LOG_EXECUTION_ID" && new == "" {
		return true
	}

	// Let diff be determined by environment_variables (above)
	if strings.HasPrefix(k, "service_config.0.environment_variables.%") {
		return true
	}

	// For other keys, don't suppress diff.
	return false
}
```


This part `if k == "service_config.0.environment_variables.LOG_EXECUTION_ID" && new == "" ` is skipping comparison for the key `LOG_EXECUTION_ID` on the map

This part `if strings.HasPrefix(k, "service_config.0.environment_variables.%")` is ignoring diferences in the size of the old and new environment variables map



when we run Terraform plan we get

```
# module.cai_monitoring.module.cloud_function.google_cloudfunctions2_function.function will be created
  + resource "google_cloudfunctions2_function" "function" {
...

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = "1"
          + available_memory                 = "256M"
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = 100
          + max_instance_request_concurrency = (known after apply)
          + min_instance_count               = 1
          + service                          = (known after apply)
          + service_account_email            = (known after apply)
          + timeout_seconds                  = 60
          + uri                              = (known after apply)
        }
    }
```

and the `service_config` map is missing the `evironment_variables`map 


if we remove the fix we get:

```
  + resource "google_cloudfunctions2_function" "function" {
...

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = "1"
          + available_memory                 = "256M"
          + environment_variables            = (known after apply) <=============
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = 100
          + max_instance_request_concurrency = (known after apply)
          + min_instance_count               = 1
          + service                          = (known after apply)
          + service_account_email            = (known after apply)
          + timeout_seconds                  = 60
          + uri                              = (known after apply)
        }
    }
```

And the `environment_variables` is back at the plan for the configuration. It has `(known after apply)` because the values of the map depend on resources that have not been created yet

Adding a log output in the code we can see the state of the variables

```
[DEBUG] provider.terraform-provider-google: 2024/07/30 23:56:19 [DEBUG] DiffSuppress  k:"service_config.0.environment_variables.%" old:"" new:""
```

`service_config.0.environment_variables.%` has the length of the Map and old and new values are empty because they do not exist yet. 

somehow this code is saying that on the plan case there is no diff between not having a map and the new map.

changing the condition 

from 
```
if strings.HasPrefix(k, "service_config.0.environment_variables.%")
```
to 

```
if strings.HasPrefix(k, "service_config.0.environment_variables.%") && new != ""
```

seems to fix the issue, and `plan`, `apply`, `apply with changes`, and `destroy` work as expected.

The same strategy of ignoring the size is used in other places to deal with labels that have key value pair added by the API when returning results.

I would like to pinpoint why this code snippet is failing in this case but seems to work in other cases.

